STMicroelectronics/STM32CubeG4/Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_qspi.c
/**
  ******************************************************************************
  * @file    stm32g474e_eval_qspi.c
  * @author  MCD Application Team
  * @brief   This file includes a standard driver for the MT25QL512ABB QSPI
  *          flash memory mounted on STM32G474E-EVAL board.
  ******************************************************************************
  @verbatim
  How To use this driver:
  -----------------------
   - This driver is used to drive the MT25QL512ABB QSPI flash
       memory mounted on STM32G474E-EVAL evaluation board.

   - This driver need a specific component driver (MT25QL512ABB) to be included with.

  Driver description:
  -------------------
   - Initialization steps:
       + Initialize the QPSI external memory using the BSP_QSPI_Init() function. This
            function includes the MSP layer hardware resources initialization and the
            QSPI interface with the external memory.
         STR and DTR transfer rates are supported.
         SPI (1-1-1), SPI 1I2O (1-1-2), SPI 2IO (1-2-2), SPI 1I4O (1-1-4), SPI 4IO (1-4-4),
            DPI (2-2-2) and QPI (4-4-4) modes are supported

   - QSPI memory operations
       + QSPI memory can be accessed with read/write operations once it is
            initialized.
            Read/write operation can be performed with AHB access using the functions
            BSP_QSPI_Read()/BSP_QSPI_Write().
       + The function BSP_QSPI_GetInfo() returns the configuration of the QSPI memory.
            (see the QSPI memory data sheet)
       + Perform erase block operation using the function BSP_QSPI_EraseBlock() and by
            specifying the block address. You can perform an erase operation of the whole
            chip by calling the function BSP_QSPI_EraseChip().
       + The function BSP_QSPI_GetStatus() returns the current status of the QSPI memory.
            (see the QSPI memory data sheet)
       + The function BSP_QSPI_EnableMemoryMappedMode enables the QSPI memory mapped mode
       + The function BSP_QSPI_DisableMemoryMappedMode disables the QSPI memory mapped mode
       + The function BSP_QSPI_ReadID() returns 3 bytes memory IDs: Manufacturer ID,
             Memory type, Memory density
       + The function BSP_QSPI_ConfigFlash() allow to configure the QSPI mode and transfer rate
       + The function BSP_QSPI_SelectFlashID(), in single flash mode, allow to select one
             of the two flash memories available.

  Note:
  --------
    Regarding the "Instance" parameter, needed for all functions, it is used to select
    a QSPI instance. On the STM32G474E-EVAL board, there's one instance on which two
    flash memories are connected. Then, this parameter should be 0.

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2018 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32g474e_eval_qspi.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32G474E-EVAL
  * @{
  */

/** @defgroup STM32G474E-EVAL_QSPI STM32G474E-EVAL QSPI
  * @{
  */

/** @defgroup STM32G474E-EVAL_QSPI_Exported_Variables Exported Variables
  * @{
  */
QSPI_HandleTypeDef hqspi;
QSPI_Ctx_t QSPICtx[QSPI_INSTANCES_NUMBER];
/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/

/** STM32G474E-EVAL_QSPI_Private_FunctionPrototypes Private Functions
  */
static void QSPI_MspInit(QSPI_HandleTypeDef *hqspi);
static void QSPI_MspDeInit(QSPI_HandleTypeDef *hqspi);
static int32_t QSPI_ResetMemory(uint32_t Instance);
static int32_t QSPI_SetODS(uint32_t Instance);
static int32_t QSPI_EnterDPIMode(uint32_t Instance);
static int32_t QSPI_ExitDPIMode(uint32_t Instance);
/**
  */

/** @addtogroup STM32G474E-EVAL_QSPI_Exported_Functions
  * @{
  */

/**
  * @brief  Initializes the QSPI interface.
  * @param  Instance   QSPI Instance
  * @param  Init       QSPI Init structure
  * @retval BSP status
  */
int32_t BSP_QSPI_Init(uint32_t Instance, BSP_QSPI_Init_t *Init)
{
  int32_t ret;
  BSP_QSPI_Info_t pInfo;
  MX_QSPI_Config qspi_config;

  /* Table to handle clock prescalers:
     QSPI freq = SYSCLK /(1 + ClockPrescaler) Mhz
  1: For STR mode to reach max flash clock freq 133Mhz
  2: For DTR mode to reach max flash clock freq 90Mhz
  */
  static const uint32_t PrescalerTab[2] = {1U, 2U};

  /* Check if the instance is supported */
  if(Instance >= QSPI_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Check if instance is already initialized */
    if(QSPICtx[Instance].IsInitialized == QSPI_ACCESS_NONE)
    {
#if (USE_HAL_QSPI_REGISTER_CALLBACKS == 1)
      /* Register the QSPI MSP Callbacks */
      if(QSPICtx[Instance].IsMspCallbacksValid == 0UL)
      {
        if(BSP_QSPI_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
        {
          return BSP_ERROR_PERIPH_FAILURE;
        }
      }
#else
      /* Msp QSPI initialization */
      QSPI_MspInit(&hqspi);
#endif /* USE_HAL_QSPI_REGISTER_CALLBACKS */

      /* Get Flash informations of one memory */
      (void)MT25QL512ABB_GetFlashInfo(&pInfo);

      /* Fill config structure */
      qspi_config.ClockPrescaler = PrescalerTab[Init->TransferRate];
      qspi_config.DualFlashMode  = QSPI_DUALFLASH_ENABLE;
      qspi_config.FlashSize      = (Init->DualFlashMode == BSP_QSPI_DUALFLASH_ENABLE) ? (uint32_t)POSITION_VAL((uint32_t)pInfo.FlashSize) : ((uint32_t)POSITION_VAL((uint32_t)pInfo.FlashSize) - 1U);
      qspi_config.SampleShifting = QSPI_SAMPLE_SHIFTING_NONE;

