STMicroelectronics/STM32CubeG4/Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_qspi.c
  /* Check if the instance is supported */
  if(Instance >= QSPI_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    (void)MT25QL512ABB_GetFlashInfo(pInfo);
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Configure the QSPI in memory-mapped mode
  *         Only 1 Instance can running MMP mode. And it will lock system at this mode.
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_EnableMemoryMappedMode(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if(QSPICtx[Instance].TransferRate == BSP_QSPI_STR_TRANSFER)
    {
      if(MT25QL512ABB_EnableMemoryMappedModeSTR(&hqspi, QSPICtx[Instance].InterfaceMode, MT25QL512ABB_4BYTES_SIZE) != MT25QL512ABB_OK)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else /* Update QSPI context if all operations are well done */
      {
        QSPICtx[Instance].IsInitialized = QSPI_ACCESS_MMP;
      }
    }
    else
    {
      if(MT25QL512ABB_EnableMemoryMappedModeDTR(&hqspi, QSPICtx[Instance].InterfaceMode, MT25QL512ABB_4BYTES_SIZE) != MT25QL512ABB_OK)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else /* Update QSPI context if all operations are well done */
      {
        QSPICtx[Instance].IsInitialized = QSPI_ACCESS_MMP;
      }
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Exit form memory-mapped mode
  *         Only 1 Instance can running MMP mode. And it will lock system at this mode.
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
int32_t BSP_QSPI_DisableMemoryMappedMode(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if(QSPICtx[Instance].IsInitialized != QSPI_ACCESS_MMP)
    {
      ret = BSP_ERROR_QSPI_MMP_UNLOCK_FAILURE;
    }/* Abort MMP back to indirect mode */
    else if(HAL_QSPI_Abort(&hqspi) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if(HAL_QSPI_Init(&hqspi)!= HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else /* Update QSPI context if all operations are well done */
    {
      QSPICtx[Instance].IsInitialized = QSPI_ACCESS_INDIRECT;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  In dual flash mode disabled, Get flash ID 3 Bytes:
  *         Manufacturer ID, Memory type, Memory density
  *         In dual flash mode enabled, Get 2 set of flash ID 3 bytes:
  *         Manufacturer ID 1, Manufacturer ID 2, Memory type 1, Memory type 2,
  *         Memory density 1, Memory density 2
  * @param  Instance  QSPI instance
  * @param  Id Pointer to flash ID bytes
  * @retval BSP status
  */
int32_t BSP_QSPI_ReadID(uint32_t Instance, uint8_t *Id)
{
  int32_t ret;

  /* Check if the instance is supported */
  if(Instance >= QSPI_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(MT25QL512ABB_ReadID(&hqspi, QSPICtx[Instance].InterfaceMode, Id, QSPICtx[Instance].DualFlashMode) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    ret = BSP_ERROR_NONE;
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Set Flash to desired Interface mode. And this instance becomes current instance.
  *         If current instance running at MMP mode then this function doesn't work.
  *         Indirect -> Indirect
  * @param  Instance  QSPI instance
  * @param  Mode      QSPI mode
  * @param  Rate      QSPI transfer rate
  * @retval BSP status
  */
int32_t BSP_QSPI_ConfigFlash(uint32_t Instance, BSP_QSPI_Interface_t Mode, BSP_QSPI_Transfer_t Rate)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if(Instance >= QSPI_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Check if MMP mode locked ************************************************/
    if(QSPICtx[Instance].IsInitialized == QSPI_ACCESS_MMP)
    {
      ret = BSP_ERROR_QSPI_MMP_LOCK_FAILURE;
    }
    else
    {
      /* Setup Flash interface ***************************************************/
      switch(QSPICtx[Instance].InterfaceMode)
      {
      case BSP_QSPI_QPI_MODE :               /* 4-4-4 commands */
        if(Mode != BSP_QSPI_QPI_MODE)
        {
          /* Exit Quad I/O protocol mode */
          if(MT25QL512ABB_ExitQPIMode(&hqspi) != MT25QL512ABB_OK)
          {
            ret = BSP_ERROR_COMPONENT_FAILURE;
          }
          else if(Mode == BSP_QSPI_DPI_MODE)
          {
            /* Enter Dual I/O protocol mode */
            ret = QSPI_EnterDPIMode(Instance);
          }
          else
          {
            /* Nothing to do */
          }
        }
        break;

      case BSP_QSPI_DPI_MODE :               /* 2-2-2 commands */
        if(Mode != BSP_QSPI_DPI_MODE)
        {
          /* Exit Dual I/O protocol mode */
          if(QSPI_ExitDPIMode(Instance) != BSP_ERROR_NONE)
          {
            ret = BSP_ERROR_COMPONENT_FAILURE;
          }
          else if(Mode == BSP_QSPI_QPI_MODE)
          {
            /* Enter Quad I/O protocol mode */
            if(MT25QL512ABB_EnterQPIMode(&hqspi) != MT25QL512ABB_OK)
            {
              ret = BSP_ERROR_COMPONENT_FAILURE;
            }
          }
          else
          {
            /* Nothing to do */
          }
        }
        break;

      case BSP_QSPI_SPI_MODE :               /* 1-1-1 commands, Power on H/W default setting */
      case BSP_QSPI_SPI_1I2O_MODE :          /* 1-1-2 commands */
      case BSP_QSPI_SPI_2IO_MODE :           /* 1-2-2 commands */
      case BSP_QSPI_SPI_1I4O_MODE :          /* 1-1-4 commands */
      case BSP_QSPI_SPI_4IO_MODE :           /* 1-4-4 commands */
      default :
        if(Mode == BSP_QSPI_QPI_MODE)
        {
          /* Enter Quad I/O protocol mode */
          if(MT25QL512ABB_EnterQPIMode(&hqspi) != MT25QL512ABB_OK)
          {
            ret = BSP_ERROR_COMPONENT_FAILURE;
          }
        }
        else if(Mode == BSP_QSPI_DPI_MODE)
        {
          /* Enter Dual I/O protocol mode */
          ret = QSPI_EnterDPIMode(Instance);
        }
        else
        {
          /* Nothing to do */
        }
        break;
      }

      /* Update QSPI context if all operations are well done */
      if(ret == BSP_ERROR_NONE)
      {
        /* Update current status parameter *****************************************/
        QSPICtx[Instance].IsInitialized = QSPI_ACCESS_INDIRECT;
        QSPICtx[Instance].InterfaceMode = Mode;
        QSPICtx[Instance].TransferRate  = Rate;
      }
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Select Flash memory ID
  *         This function is applicable in single flash mode to select one of the two
  *         flash memory available. It has no effect in dual flash mode.
  * @param  Instance  QSPI instance
  * @param  FlashID   Flash memory ID
  * @retval BSP status
  */
int32_t BSP_QSPI_SelectFlashID(uint32_t Instance, uint32_t FlashID)
{
  int32_t ret;

