STMicroelectronics/STM32CubeG4/Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_qspi.c
  /* Check if the instance is supported */
  if(Instance >= QSPI_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  } /* Perform flash ID selection */
  else if(HAL_QSPI_SetFlashID(&hqspi, FlashID) != HAL_OK)
  {
    ret = BSP_ERROR_PERIPH_FAILURE;
  }
  else
  {
    ret = BSP_ERROR_NONE;
  }

  /* Return BSP status */
  return ret;
}

/**
  * @}
  */

/** @defgroup STM32G474E-EVAL_QSPI_Private_Functions Private Functions
  * @{
  */

/**
  * @brief QSPI MSP Initialization
  * @param hqspi: QSPI handle
  *        This function configures the hardware resources used in this example:
  *           - Peripheral's clock enable
  *           - Peripheral's GPIO Configuration
  *           - NVIC configuration for QSPI interrupt
  * @retval None
  */
static void QSPI_MspInit(QSPI_HandleTypeDef *hqspi)
{
  GPIO_InitTypeDef gpio_init_structure;

  /* Prevent unused argument(s) compilation warning */
  UNUSED(hqspi);

  /*##-1- Enable peripherals and GPIO Clocks #################################*/
  /* Enable the QuadSPI memory interface clock */
  QSPI_CLK_ENABLE();

  /* Reset the QuadSPI memory interface */
  QSPI_FORCE_RESET();
  QSPI_RELEASE_RESET();

  /* Enable GPIO clocks */
  QSPI_CLK_GPIO_CLK_ENABLE();

  QSPI_BK1_CS_GPIO_CLK_ENABLE();
  QSPI_BK1_D0_GPIO_CLK_ENABLE();
  QSPI_BK1_D1_GPIO_CLK_ENABLE();
  QSPI_BK1_D2_GPIO_CLK_ENABLE();
  QSPI_BK1_D3_GPIO_CLK_ENABLE();

  QSPI_BK2_CS_GPIO_CLK_ENABLE();
  QSPI_BK2_D0_GPIO_CLK_ENABLE();
  QSPI_BK2_D1_GPIO_CLK_ENABLE();
  QSPI_BK2_D2_GPIO_CLK_ENABLE();
  QSPI_BK2_D3_GPIO_CLK_ENABLE();

  /*##-2- Configure peripheral GPIO ##########################################*/
  /* QSPI CLK GPIO pin configuration  */
  gpio_init_structure.Pin       = QSPI_CLK_PIN;
  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
  gpio_init_structure.Alternate = QSPI_CLK_PIN_AF;
  HAL_GPIO_Init(QSPI_CLK_GPIO_PORT, &gpio_init_structure);

  /* QSPI BK1 CS GPIO pin configuration  */
  gpio_init_structure.Pin       = QSPI_BK1_CS_PIN;
  gpio_init_structure.Pull      = GPIO_PULLUP;
  gpio_init_structure.Alternate = QSPI_BK1_CS_PIN_AF;
  HAL_GPIO_Init(QSPI_BK1_CS_GPIO_PORT, &gpio_init_structure);

  /* QSPI BK1 D0 GPIO pin configuration  */
  gpio_init_structure.Pin       = QSPI_BK1_D0_PIN;
  gpio_init_structure.Alternate = QSPI_BK1_D0_PIN_AF;
  HAL_GPIO_Init(QSPI_BK1_D0_GPIO_PORT, &gpio_init_structure);

  /* QSPI BK1 D1 GPIO pin configuration  */
  gpio_init_structure.Pin       = QSPI_BK1_D1_PIN;
  gpio_init_structure.Alternate = QSPI_BK1_D1_PIN_AF;
  HAL_GPIO_Init(QSPI_BK1_D1_GPIO_PORT, &gpio_init_structure);

  /* QSPI BK1 D2 GPIO pin configuration  */
  gpio_init_structure.Pin       = QSPI_BK1_D2_PIN;
  gpio_init_structure.Alternate = QSPI_BK1_D2_PIN_AF;
  HAL_GPIO_Init(QSPI_BK1_D2_GPIO_PORT, &gpio_init_structure);

  /* QSPI BK1 D3 GPIO pin configuration  */
  gpio_init_structure.Pin       = QSPI_BK1_D3_PIN;
  gpio_init_structure.Alternate = QSPI_BK1_D3_PIN_AF;
  HAL_GPIO_Init(QSPI_BK1_D3_GPIO_PORT, &gpio_init_structure);

  /* QSPI BK2 CS GPIO pin configuration  */
  gpio_init_structure.Pin       = QSPI_BK2_CS_PIN;
  gpio_init_structure.Alternate = QSPI_BK2_CS_PIN_AF;
  HAL_GPIO_Init(QSPI_BK2_CS_GPIO_PORT, &gpio_init_structure);

  /* QSPI BK2 D0 GPIO pin configuration  */
  gpio_init_structure.Pin       = QSPI_BK2_D0_PIN;
  gpio_init_structure.Alternate = QSPI_BK2_D0_PIN_AF;
  HAL_GPIO_Init(QSPI_BK2_D0_GPIO_PORT, &gpio_init_structure);

  /* QSPI BK2 D1 GPIO pin configuration  */
  gpio_init_structure.Pin       = QSPI_BK2_D1_PIN;
  gpio_init_structure.Alternate = QSPI_BK2_D1_PIN_AF;
  HAL_GPIO_Init(QSPI_BK2_D1_GPIO_PORT, &gpio_init_structure);

  /* QSPI BK2 D2 GPIO pin configuration  */
  gpio_init_structure.Pin       = QSPI_BK2_D2_PIN;
  gpio_init_structure.Alternate = QSPI_BK2_D2_PIN_AF;
  HAL_GPIO_Init(QSPI_BK2_D2_GPIO_PORT, &gpio_init_structure);

  /* QSPI BK2 D3 GPIO pin configuration  */
  gpio_init_structure.Pin       = QSPI_BK2_D3_PIN;
  gpio_init_structure.Alternate = QSPI_BK2_D3_PIN_AF;
  HAL_GPIO_Init(QSPI_BK2_D3_GPIO_PORT, &gpio_init_structure);
}

/**
  * @brief QSPI MSP De-Initialization
  * @param hqspi: QSPI handle
  *        This function frees the hardware resources used in this example:
  *          - Disable the Peripheral's clock
  *          - Revert GPIO and NVIC configuration to their default state
  * @retval None
  */
static void QSPI_MspDeInit(QSPI_HandleTypeDef *hqspi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hqspi);

  /*##-2- Disable peripherals and GPIO Clocks ################################*/
  /* De-Configure QSPI pins */
  HAL_GPIO_DeInit(QSPI_CLK_GPIO_PORT, QSPI_CLK_PIN);
  HAL_GPIO_DeInit(QSPI_BK1_CS_GPIO_PORT, QSPI_BK1_CS_PIN);
  HAL_GPIO_DeInit(QSPI_BK1_D0_GPIO_PORT, QSPI_BK1_D0_PIN);
  HAL_GPIO_DeInit(QSPI_BK1_D1_GPIO_PORT, QSPI_BK1_D1_PIN);
  HAL_GPIO_DeInit(QSPI_BK1_D2_GPIO_PORT, QSPI_BK1_D2_PIN);
  HAL_GPIO_DeInit(QSPI_BK1_D3_GPIO_PORT, QSPI_BK1_D3_PIN);
  HAL_GPIO_DeInit(QSPI_BK2_CS_GPIO_PORT, QSPI_BK2_CS_PIN);
  HAL_GPIO_DeInit(QSPI_BK2_D0_GPIO_PORT, QSPI_BK2_D0_PIN);
  HAL_GPIO_DeInit(QSPI_BK2_D1_GPIO_PORT, QSPI_BK2_D1_PIN);
  HAL_GPIO_DeInit(QSPI_BK2_D2_GPIO_PORT, QSPI_BK2_D2_PIN);
  HAL_GPIO_DeInit(QSPI_BK2_D3_GPIO_PORT, QSPI_BK2_D3_PIN);

  /*##-3- Reset peripherals ##################################################*/
  /* Reset the QuadSPI memory interface */
  QSPI_FORCE_RESET();
  QSPI_RELEASE_RESET();

  /* Disable the QuadSPI memory interface clock */
  QSPI_CLK_DISABLE();
}

/**
  * @brief  This function reset the QSPI Flash memory.
  *         Force QPI+DPI+SPI reset to avoid system come from unknown status.
  *         Flash accept SPI commands after reset.
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
static int32_t QSPI_ResetMemory(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Send RESET enable command in QPI mode (QUAD I/Os, 4-0-0) */
  if(MT25QL512ABB_ResetEnable(&hqspi, BSP_QSPI_QPI_MODE) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }/* Send RESET memory command in QPI mode (QUAD I/Os, 4-0-0) */
  else if(MT25QL512ABB_ResetMemory(&hqspi, BSP_QSPI_QPI_MODE) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }/* Send RESET enable command in DPI mode (2-0-0) */
  else if(MT25QL512ABB_ResetEnable(&hqspi, BSP_QSPI_DPI_MODE) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }/* Send RESET memory command in DPI mode (2-0-0) */
  else if(MT25QL512ABB_ResetMemory(&hqspi, BSP_QSPI_DPI_MODE) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }/* Send RESET enable command in SPI mode (1-0-0) */
  else if(MT25QL512ABB_ResetEnable(&hqspi, BSP_QSPI_SPI_MODE) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }/* Send RESET memory command in SPI mode (1-0-0) */
  else if(MT25QL512ABB_ResetMemory(&hqspi, BSP_QSPI_SPI_MODE) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    QSPICtx[Instance].IsInitialized = QSPI_ACCESS_INDIRECT;      /* After reset S/W setting to indirect access   */
    QSPICtx[Instance].InterfaceMode = BSP_QSPI_SPI_MODE;         /* After reset H/W back to SPI mode by default  */
    QSPICtx[Instance].TransferRate  = BSP_QSPI_STR_TRANSFER;     /* After reset S/W setting to STR mode          */

    /* After SWreset CMD, wait in case SWReset occurred during erase operation */
    HAL_Delay(MT25QL512ABB_RESET_MAX_TIME);
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  This function configure the Output Driver Strength on memory side.
  *         ODS bit locate in Enhanced Volatile Configuration Register[2:0]
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
static int32_t QSPI_SetODS(uint32_t Instance)
{
  int32_t ret;
  uint8_t reg[2];  /* reg[0] contains reg value for FLASHID_1,
                      reg[1] contains reg value for FLASHID_2 in case of dual flash mode */

  if(MT25QL512ABB_ReadEnhancedVolCfgRegister(&hqspi, QSPICtx[Instance].InterfaceMode, QSPICtx[Instance].DualFlashMode, reg) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    /* Set Output Strength of the QSPI memory as CONF_QSPI_ODS variable ohms */
    MODIFY_REG(reg[0], MT25QL512ABB_EVCR_ODS, (((uint8_t)CONF_QSPI_ODS) << (POSITION_VAL(MT25QL512ABB_EVCR_ODS) & 0x7U)));
    MODIFY_REG(reg[1], MT25QL512ABB_EVCR_ODS, (((uint8_t)CONF_QSPI_ODS) << (POSITION_VAL(MT25QL512ABB_EVCR_ODS) & 0x7U)));

    /* Enable write operations */
    if (MT25QL512ABB_WriteEnable(&hqspi, QSPICtx[Instance].InterfaceMode, QSPICtx[Instance].DualFlashMode) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Issue Write command */
    else if(MT25QL512ABB_WriteEnhancedVolCfgRegister(&hqspi, QSPICtx[Instance].InterfaceMode, QSPICtx[Instance].DualFlashMode, reg) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Configure automatic polling mode to wait for end of program */
    else if (MT25QL512ABB_AutoPollingMemReady(&hqspi, QSPICtx[Instance].InterfaceMode, QSPICtx[Instance].DualFlashMode) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      ret = BSP_ERROR_NONE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  This function put QSPI memory in DPI mode (Dual I/O) from SPI mode.
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
static int32_t QSPI_EnterDPIMode(uint32_t Instance)
{
  int32_t ret;
  uint8_t reg[2];  /* reg[0] contains reg value for FLASHID_1,
                      reg[1] contains reg value for FLASHID_2 in case of dual flash mode */

  if(MT25QL512ABB_ReadEnhancedVolCfgRegister(&hqspi, QSPICtx[Instance].InterfaceMode, QSPICtx[Instance].DualFlashMode, reg) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    /* Set Dual I/O protocol */
    CLEAR_BIT(reg[0], MT25QL512ABB_EVCR_DPI);
    CLEAR_BIT(reg[1], MT25QL512ABB_EVCR_DPI);

    /* Enable write operations */
    if (MT25QL512ABB_WriteEnable(&hqspi, QSPICtx[Instance].InterfaceMode, QSPICtx[Instance].DualFlashMode) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Issue Write command */
    else if(MT25QL512ABB_WriteEnhancedVolCfgRegister(&hqspi, QSPICtx[Instance].InterfaceMode, QSPICtx[Instance].DualFlashMode, reg) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Configure automatic polling mode to wait for end of program */
    else if (MT25QL512ABB_AutoPollingMemReady(&hqspi, BSP_QSPI_DPI_MODE, QSPICtx[Instance].DualFlashMode) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      ret = BSP_ERROR_NONE;
    }
  }

/* Return BSP status */
  return ret;
}

/**
  * @brief  This function put QSPI memory in SPI mode from DPI mode (Dual I/O).
  * @param  Instance  QSPI instance
  * @retval BSP status
  */
static int32_t QSPI_ExitDPIMode(uint32_t Instance)
{
  int32_t ret;
  uint8_t reg[2];  /* reg[0] contains reg value for FLASHID_1,
                      reg[1] contains reg value for FLASHID_2 in case of dual flash mode */

  if(MT25QL512ABB_ReadEnhancedVolCfgRegister(&hqspi, BSP_QSPI_DPI_MODE, QSPICtx[Instance].DualFlashMode, reg) != MT25QL512ABB_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    /* Disable Dual I/O protocol */
    SET_BIT(reg[0], MT25QL512ABB_EVCR_DPI);
    SET_BIT(reg[1], MT25QL512ABB_EVCR_DPI);

    /* Enable write operations */
    if (MT25QL512ABB_WriteEnable(&hqspi, BSP_QSPI_DPI_MODE, QSPICtx[Instance].DualFlashMode) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Issue Write command */
    else if(MT25QL512ABB_WriteEnhancedVolCfgRegister(&hqspi, BSP_QSPI_DPI_MODE, QSPICtx[Instance].DualFlashMode, reg) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Configure automatic polling mode to wait for end of program */
    else if (MT25QL512ABB_AutoPollingMemReady(&hqspi, QSPICtx[Instance].InterfaceMode, QSPICtx[Instance].DualFlashMode) != MT25QL512ABB_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      ret = BSP_ERROR_NONE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

